-- MySQL dump 10.13  Distrib 8.0.35, for Win64 (x86_64)
--
-- Host: localhost    Database: cornleaf
-- ------------------------------------------------------
-- Server version	8.0.35

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `disease`
--

DROP TABLE IF EXISTS `disease`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `disease` (
  `id` int NOT NULL AUTO_INCREMENT,
  `disease_name` varchar(255) DEFAULT NULL,
  `introduction` text,
  `pathogenic_features` text,
  `symptoms_of_harm` text,
  `onset_conditions` text,
  `treatment` text,
  `alias` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `disease`
--

LOCK TABLES `disease` WRITE;
/*!40000 ALTER TABLE `disease` DISABLE KEYS */;
INSERT INTO `disease` VALUES (1,'矮化叶病','玉米矮花叶病又名玉米花叶条纹病、黄绿条纹病，是由玉米矮花叶病病毒引起的、发生在玉米上的一种病害。玉米矮花叶病在玉米整个生育期均可发生，苗期受害较重。植株初时心叶基部叶脉间出现许多椭圆形、褪绿色小点或斑纹，沿叶脉排列，然后叶色变黄，有的甚至直接干枯。玉米矮花叶病是世界也是中国玉米主要病害之一。在中国分布甚广，玉米重要栽培区都有此病发生。但只在中国华北的大部，西南及西北地区的局部为害较重，一般损失3-10%。','玉米矮花叶病是由玉米矮花叶病病毒（Maize dwarf mosaic irus，简称MDMV）','玉米矮花叶病主要在玉米幼苗至抽雄前感病。病株最初在心叶基部的细脉间出现许多椭圆形褪绿小点，断续排列，呈典型的条点花叶状。病部受粗叶脉限制扩展，脉缘绿色，但易越过细叶脉形成较宽的褪绿条纹，显出黄绿相间的条纹症状。如条件适宜，病部扩展则不受粗脉或中脉的限制，迅速扩展至全叶，形成黄绿二色相间的花叶症状，重病叶变黄，组织脆硬易折，最后叶尖、叶缘变红紫干枯。果穗的苞叶有时也可显现花叶症状。感病品种苗期感病后，株高仅为健株的1/2-1/3，不能抽穗或抽而不实，在收获前即死亡。拔节至抽穗前感病，株高为健株的1/2-4/5，若管理得好，气温较高，受害减少。抽穗前后感病时，株高接近正常，产量基本无损失。病株根系不发达，后期易萎缩腐烂，引致其他菌类腐生。','玉米矮花叶病病毒主要在雀麦、牛鞭草等多年禾本科杂草上越冬，成为主要的初侵染源。带毒种子出苗后成为田间的发病中心。病毒主要靠蚜虫扩散和传播，蚜虫从病毒的越冬寄主植物上取食获毒，再迁飞到玉米苗上取食进行传毒。发病后的植株和种子带毒苗作为田间的中心毒源，随着蚜虫的取食活动，病毒被传向四周。传毒蚜虫主要有玉米蚜、禾谷缢管蚜、麦二叉蚜、麦长管蚜、棉蚜、桃蚜等23种，以非持久性方式进行传毒，及吸毒后马上传毒，很快又失去传毒能力。叶片间的摩擦也可以传毒。玉米收获后，带毒蚜虫又迁飞到杂草上传毒越冬','农业防治\n1.轮作：对已发生病害的玉米种植地进行轮作换茬，减少田间病毒的积累，有利于减轻病害的发生。\n2.选用抗、耐病品种：可选用农大3138、豫玉22、苏玉19号、苏玉20号等抗病丰产良种。\n3.深翻晒白，清洁田园：播种前，地块应充分深翻晒白、平整作畦，并清除田间及其周围杂草，集中烧毁或沤肥，减少田间病源和虫源。\n4.加强栽培管理：一是合理施肥，施足底肥，实行氮、磷、钾平衡施肥，及时适量追肥。二是开好排水沟，降低地下水位，大雨过后及时清理沟渠，防止湿气滞留；高温干旱时适当灌水或浇水，以提高田间湿度，减轻蚜虫为害及传播，但严禁连续灌水和大水漫灌；避免阴雨天进行农事操作。三是适时中耕、除草、松土，增加土壤的透气性，促进植株健壮生长，增强植株抗病能力。\n5.及时拔除田间病株，清除病残体：早期玉米田出现矮花叶病的病株时，要及时拔除并带出田外深埋或烧毁，玉米收获后对田间的残枝落叶要彻底清除干净，以减少传染源。\n化学防治\n1.药剂拌种：可用内吸性杀虫剂对种子进行拌种，可以有效防治苗期蚜虫，减轻苗期矮花叶病的传播；也可用种衣剂拌种，不仅可防治蚜虫，还有利于培养壮苗，提高玉米的抗病力。\n2.及时消灭传毒虫源：从苗期开始防治蚜虫，可选用3%啶虫咪乳油2000倍液或抗蚜威可湿性粉剂3000倍液或10%吡虫啉可湿性粉剂1500倍液喷施。喷药时，玉米田周围的杂草也要喷施，可降低虫口密度。必要时，可用克无踪或农达等除草剂对田边地头进行喷雾，杀死田边杂草，尤其是多年生杂草，以降低蚜虫基数。\n3.药剂防治：抓紧在发病初期，选用5%菌毒清水剂300倍液、1.5%植病灵乳剂1000倍液、15%病毒必克可湿性粉剂500倍液、20%病毒A可湿性粉剂400倍液、20%病毒灵水溶剂500倍液等，交替施用。每隔7-10天喷1次，连喷3-4次；同时配合施用叶面肥，如磷酸二氢钾、植物动力2003、农家宝、芸苔素等，增强植株抗病补偿能力。根据生产实践，一旦发现田间有玉米发病，应立即施药，并结合浇水追肥，可取得较好的保产效果。','矮化叶病'),(2,'锈病','玉米锈病是由玉米柄锈菌引起、发生在玉米的病害。主要发生在玉米叶片上，也能够侵染叶鞘、茎秆和苞叶。\n玉米锈病在中国的主要发生区域为北方夏玉米种植区；在华东、华南、西南等南方各省也有发生，但一般对生产影响有限。发病后，叶片被橘黄色的夏孢子堆和夏孢子所覆盖，导致叶片干枯死亡，轻者减产10-20%，重者达30%以上，严重地块甚至绝收。玉米柄锈菌喜温暖潮湿的环境，发病温度范围15-35℃；最适发病环境温度为20-30℃，相对湿度95%以上；最适感病生育期为开花结穗到采收中后期。','玉米锈病的病原为担子菌亚门真菌玉米柄锈菌（Puccinia sorghi）','玉米锈病主要发生在玉米叶片上，也能够侵染叶鞘、茎秆和苞叶。侵染初期，叶片两面初生淡黄白色小斑，四周有黄色晕圈，后突起形成黄褐色乃至红褐色疱斑，散生或聚生圆形或长圆形，即病菌的夏孢子堆。孢子堆表皮破裂后，散出铁锈状夏孢子。后期病斑或其附近又出现黑色疱斑，即病菌的冬孢子堆，长椭圆形，疱斑破裂散出黑褐色粉状物。\n发病严重时，整张叶片可布满锈褐色病斑，引起叶片枯黄，同时可危害苞叶、果穗和雄花。','玉米柄锈菌以冬孢子随病株残余组织遗留在田间越冬。入春后当环境条件适宜时冬孢子即可萌发并产生担孢子，借气流传播到寄主作物，由叶面气孔直接侵入，引起初次侵染。田间少量植株发病后，在病部产生锈孢子，形成夏孢子堆并散发出夏孢子，夏孢子借气流传播进行再侵染，在植株间扩散蔓延，加重危害；直到秋季，产生冬孢子堆和冬孢子','农业防治\n品种选择：选育耐病品种，种植中、晚熟品种。\n茬口轮作：与其他非豆科作物实行2年以上轮作。\n清洁田园：收获后及时清除田间病残体，带出地外集中烧毁或深埋，深翻土壤，减少土表越冬病菌。\n加强田间管理：深沟高畦栽培，合理密植，科学施肥，增施有机肥和磷钾肥，及时整枝，开好排水沟系，使雨后及时排水。\n化学防治\n在发病初期开始喷药，每隔7-10天喷1次，连续喷1-2次。\n绿色防治用药：可选用20%苯醚甲环唑微乳剂（捷菌）1500-2000倍液（每亩用量30-60克）；30%氟硅唑微乳剂（世飞）300-5000倍液（每亩用量12-15克）；40%氟硅唑（福星）乳油6000-8000倍液（每亩用量7.5-10克）；18%戊唑醇微乳剂（安盈）1000-2000倍液（每亩用量50-100克）；10%苯醚甲环唑水分散粒剂（世高）800-1200倍液（每亩用量50-75克）；43%戊唑醇悬浮剂（好力克）3000-4000倍液（每亩用量15-20克）；75%肟菌·戊唑醇水分散剂（拿敌稳）3000倍液（每亩用量25-35克）等喷雾防治。\n常规防治用药：80%代森锰锌可湿性粉剂（山德生）600-800倍液（每亩用量75-100克）等喷雾防治。','无'),(3,'叶斑病','主要为害叶片和苞叶。病斑不规则、透光，中央灰白色，边缘褐色，上生黑色小点，即病原菌的子囊座。分布在吉林、辽宁、河南等省。','病原菌的子囊座','玉米小斑病：症状主要为害玉米叶片，病斑有3种。其一，受叶脉限制的椭圆或近长方形病斑，黄褐色，边缘深褐色；其二，不受叶脉限制的灰褐色椭圆形病斑。其三，为黄褐色坏死小斑点。多数病斑连在一起，造成叶片枯死。\n玉米大斑病：症状主要为害玉米叶片。下部叶片先出现水渍状青灰色斑点，然后沿叶脉向两端扩展，病斑呈长梭型、中央淡褐色，外缘暗褐色，当田间湿润度大时，病斑表面产生灰黑色霉状物。严重时病斑融合，造成整个叶片枯死','冷湿条件易发病，病菌在病残体上越冬，翌年春季形成子囊孢子，进行初侵染','种子选取\n选用抗（耐）病品种兼抗大、小斑病的玉米杂交种有：京早7号，桂单16等。\n农业防治\n实行轮作倒茬制度避免玉米连作，秋季深翻土壤，深埋病残株、消来菌源；作燃料用的玉米秸杆，开春后及早处理完，并可兼治玉米螟；病残体作堆肥要充分腐熟，秸秆肥最好不在玉米地施用。改善栽培技术，增强玉米抗病性夏玉米早播可明显减轻发病，适当增施磷肥，注意氮、磷钾肥合便搭配，重施喇叭口肥，实行玉米大豆间作，或与小麦、花生、甘薯等间作套种，宽、窄行种植；合理灌溉，低洼地注意田间排水。\n药剂治疗\n喷药防治由于玉米植株高、密植等客观条件限制，可重点对制种田、间作田各高产试验田等进行药剂防治。一般于病情扩展前防治，即可在玉米抽雄前后，当田间病株率达70％以上，病叶率20％左右时，开始喷药。防效较好的药剂各类有：50％多菌灵可湿性粉剂，50％敌菌灵可湿性粉或90％代森锰锌，均加水500倍，或40％克瘟散乳油800倍喷雾。每亩用药液50-75公斤，隔7-10天喷药1次，共防治2-3次。','条斑病、煤纹病、枯叶病、斑点病'),(4,'灰斑病','玉米灰斑病又称尾孢叶斑病、玉米霉斑病，除侵染玉米外，还可侵染高梁、香茅、须芒草等多种禾本科植物。玉米灰斑病是近年上升很快、为害较严重的病害之一。主要为害叶片。初在叶面上形成无明显边缘的椭圆形至矩圆形灰色至浅褐色病斑，后期变为褐色。病斑多限于平行叶脉之间，大小4～20×2～5(mm)。湿度大时，病斑背面生出灰色霉状物，即病菌分生孢子梗和分生孢子。','病原真菌是玉米尾孢，高粱尾孢Cercospora zeae maydis Tehon&Daniels Cercospora sorghi Ell.et Ev。','玉米灰斑病病菌主要危害叶片。初始病斑在透射光下呈针尖状褪绿的黄色小斑点，1周后，感病品种上形成长矩形病斑，长1-6 cm，宽0.2～0.4 cm，宽度受叶脉限制，多数沿玉米叶脉扩展。病斑交界处清晰。病斑中央灰色，边缘具褐色坏死线，叶片两面均可产生灰色霉层，以叶背面居多。 湿度大时，病斑背面生出灰色霉状物，即病菌分生孢子梗和分生孢子。发病严重年份，植株叶片枯死早衰.','在北方地区，一般7～8月多雨的年份易发病。病害传播很快， 一个病害侵染循环周期大约十天。高温多雨，相对湿度高的天数多的季节发病严重。 种植密度高不透风湿度会加快病害的传播, 增大风险。玉米连茬则病害的风险高。种植感病品种增加风险。如果病害在玉米生长的早期发生，后期的病害流行的风险增加。个别地块可引致大量叶片干枯。品种间抗病性有差异。\n1、品种和生育期 玉米品种之间存在抗性差异，感病品种易发病。在导致玉米灰斑病发生流行因素中，玉米本身的抗病性是主要因素。在同样环境条件和同样存在着大量病菌的情况下，不同品种的发病程度都不相同，同一品种在不同生育期，发病程度也不同，苗期基本不发病，拔节抽雄期开始发病，灌浆期暴发为害。\n2、环境条件　灰斑病的发生受气候条件影响较为明显，苗期低温多雨，成株期高温高湿，长期阴雨连绵，适宜病害的发生和流行。病害多在温暖潮湿，雾日较多，连年大面积种植感病品种的地区发生。植株叶片的生理年龄影响病害发展，病害多从下部叶片开始发生，逐叶向上发展。\n3、栽培管理 在栽培管理措施中，关系最为密切的是播种节令、种植密度和施肥管理。免耕或少耕的田块由于病残体积累发病严重，播种时间偏迟，栽培密度过大，使玉米植株过于茂密荫蔽，不施底肥和磷钾肥，偏施氮肥，后期脱肥、管理粗放的地块植株抗病力弱均有利病害发生发展。','（1）选用抗病或耐病的品种。\n（2）收获后及时清除病残体。\n（3）进行大面积轮作。\n（4）加强田间管理，雨后及时排水，防止湿气滞留。\n（5）药剂防治。（勘发病初期喷洒75%百菌清可湿性粉剂500倍液或50%多菌灵可湿性粉剂600倍液、40%克瘟散乳油800～900倍液、50%苯菌灵可湿性粉剂1500倍液、25%苯菌灵乳油800倍液、20%三唑酮乳油1000倍液。 [3]在北方地区化学防治最有效的防治时期是在玉米扬花期左右）','无');
/*!40000 ALTER TABLE `disease` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `record`
--

DROP TABLE IF EXISTS `record`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `record` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint DEFAULT NULL,
  `confidence` float DEFAULT NULL,
  `disease_id` int DEFAULT NULL,
  `create_time` date DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `record_user_null_fk` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `record`
--

LOCK TABLES `record` WRITE;
/*!40000 ALTER TABLE `record` DISABLE KEYS */;
INSERT INTO `record` VALUES (2,503829714729701376,0.968348,1,'2024-04-21');
/*!40000 ALTER TABLE `record` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL,
  `username` varchar(64) COLLATE utf8mb4_general_ci NOT NULL,
  `password` varchar(64) COLLATE utf8mb4_general_ci NOT NULL,
  `email` varchar(64) COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_user_id` (`user_id`),
  UNIQUE KEY `idx_username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,498792160905138176,'123','313233939fa1330f724e8b1da367fe21de1d81','123@qq.com'),(2,503829714729701376,'spark','313233343536939fa1330f724e8b1da367fe21de1d81','1111111111@qq.com');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-24  2:56:39
